app/controllers/archangels_controller.rb

SELECT "archangels".* FROM "archangels"
---
  def index
    @archangels = Archangel.all

INSERT INTO "archangels" ("name", "description", "color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @archangel = Archangel.new(archangel_params)

    if @archangel.save