app/controllers/orders_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" IN ($1, $2, $3, $4, $5, $6)  [["order_id", 1], ["order_id", 3], ["order_id", 4], ["order_id", 5], ["order_id", 6], ["order_id", 2]]
SELECT "orders".* FROM "orders"
---
  def index
    @orders = Order.includes(:order_items).all

INSERT INTO "orders" ("created_at", "updated_at", "first_name", "last_name", "address", "state", "city", "status", "email", "payment_link") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @order = Order.new(order_params)

    if @order.save

UPDATE "orders" SET "updated_at" = $1, "first_name" = $2, "last_name" = $3, "address" = $4, "state" = $5, "city" = $6, "status" = $7, "email" = $8 WHERE "orders"."id" = $9
---
  def update
    Rails.logger.info "Order update action triggered at #{Time.now}"

    @order.with_lock do
      if @order.update(order_params)

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2 FOR UPDATE  [["id", 13], ["LIMIT", 1]]
---
  def set_order
    @order = Order.lock('FOR UPDATE').find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "updated_at" = $1, "payment_link" = $2 WHERE "orders"."id" = $3  [["updated_at", "2024-09-11 14:34:08.715919"], ["payment_link", "https://payco.link/3363757"], ["id", 13]]
---
  def process_payment(order, token)
    request_body = {
      quantity: order.order_items.sum(&:quantity),
      amount: order.order_items.sum { |item| item.quantity * item.product.price },
      currency: 'COP',
      id: 0,
      description: 'Order payment description',
      title: "Order #{order.id}",
      typeSell: 2,
      onePayment: true
    }.to_json

    Rails.logger.info("Body: #{request_body}")

    response = HTTParty.post(
      'https://apify.epayco.co/collection/link/create',
      body: request_body,
      headers: { "Content-Type" => "application/json", "Authorization" => "Bearer #{token}" }
    )

    if response.success?
      payment_data = response.parsed_response
      data = payment_data['data']
      route_link = data['routeLink']

      if route_link.present?
        ApplicationRecord.transaction do
          order.update!(payment_link: route_link)

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2 FOR UPDATE  [["id", 1], ["LIMIT", 1]]
---
  def update_product_quantities(order)
    ApplicationRecord.transaction do
      product_quantities = order.order_items.group_by(&:product_id).transform_values do |items|
        items.sum(&:quantity)
      end

      product_quantities.each do |product_id, total_quantity|
        product = Product.lock('FOR UPDATE').find(product_id)