app/controllers/products_controller.rb

INSERT INTO "products" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Collar"], ["created_at", "2024-08-22 20:46:19.267591"], ["updated_at", "2024-08-22 20:46:19.267591"]]
---
  def create
    @product = Product.new(product_params)
    if @product.save

UPDATE "products" SET "price" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["price", "10000.0"], ["updated_at", "2024-09-11 14:43:26.490317"], ["id", 1]]
---
  def update
    if @product.update(product_params)