app/controllers/product_categories_controller.rb

SELECT "product_categories".* FROM "product_categories"
---
  def index
    @product_categories = ProductCategory.all

INSERT INTO "product_categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Collar"], ["created_at", "2024-09-02 17:07:34.944186"], ["updated_at", "2024-09-02 17:07:34.944186"]]
---
  def create
    @product_category = ProductCategory.new(product_category_params)
    if @product_category.save