app/controllers/product_references_controller.rb

SELECT "product_references".* FROM "product_references"
---
  def index
    @product_references = ProductReference.all

INSERT INTO "product_references" ("name", "description", "product_category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @product_reference = ProductReference.new(product_reference_params)
    if @product_reference.save